#include "../_启动窗口.h"

void __启动窗口::载入(窗口* 父窗, bool 模态)
{/*由白易插件从XML生成到C++请勿在此进行更改*/
	if (窗口句柄)return;
	{
		窗口::参数 cs{ 50, 50, 408, 250 }; cs.总在最前 = true; cs.边框 = 1; cs.背景颜色 = 65280;
		cs.子控件焦点导航 = true; 窗口::创建(cs, 父窗, 模态);
	}
	{
		外形框::参数 cs{ 80, 56, 200, 104 }; cs.背景颜色 = 16711680; 外形框1.创建(cs, this);
	}
	{
		单选框::参数 cs{ 48, 24, 56, 32 }; cs.背景颜色 = 128; 单选框1.创建(cs, &外形框1);
	}
	{
		选择框::参数 cs{ 56, 72, 112, 24 }; cs.文本颜色 = 16777215; cs.背景颜色 = -1;
		选择框1.创建(cs, &外形框1);
	}
	{
		单选框::参数 cs{ 8, 8, 56, 32 }; cs.背景颜色 = 128; 单选框2.创建(cs, this);
	}
	this->完毕(模态);
}

void __启动窗口::完毕(bool 模态)
{
	窗口::完毕(模态);
}
