#include "../_启动窗口.h"

void __启动窗口::载入(窗口* 父窗, bool 模态)
{
	if (窗口句柄)return;
	窗口::参数 cs;
	cs.子控件焦点导航 = true;
	cs.边框 = 窗口边框::普通可调边框;
	窗口::创建(cs, 父窗, 模态);

	按钮1.创建(按钮::参数(200, 100, 50, 30), this);

	选择夹::参数 a(10, 10, 200, 100);
	选择夹1.创建(a, this);
	图片组 tpz;
	tpz.创建(32, 32);
	tpz.添加位图(位图::从内存创建(R::超级链接框));

	选择夹1.置图片组(tpz);

	选择夹1.插入子夹(_T("测试"), nil, 0);
	选择夹1.插入子夹(_T("asd"));

	按钮* an = new 按钮;
	an->创建(按钮::参数(10, 10, 50, 30, false), 选择夹1);
	选择夹1.子夹添加组件(0, *an);

	__启动窗口::完毕(模态);
}


void __启动窗口::完毕(bool 模态)
{
	//用户后期运行时动态创建控件
	//注意，切勿写成局部变量否则出作用域后控件都会被销毁
	//要么写成动态内存，要么就统一写在#pragma region 组件成员

	按钮* btn2;
	{
		struct _ : 按钮 {
			void 事件_被单击(){
				_启动窗口.发送消息(WM_反馈, 123, 22);
			}
		}; btn2 = new _;
		btn2->创建(按钮::参数(50, 10, 50, 30, false));
	}


	按钮* btn3;
	{
		struct _ : 按钮 {
			void 事件_被单击(){
				_启动窗口.发送消息(WM_反馈, 123, 33);
			}
		}; btn3 = new _;
		btn3->创建(按钮::参数(100, 30, 50, 30, false));
	}

	//也可用下面lambda
	//auto an3 = []{struct _ :按钮{
	//	void 事件_被单击(){
	//	}
	//}; return new _; }();
	//an3->创建(按钮::参数(100, 30, 50, 30, false));


	选择夹1.子夹添加组件(1, *btn2);
	选择夹1.子夹添加组件(1, *btn3);

	窗口::完毕(模态);
}