#include <BEMod.h>
#include "../扩展界面库一.h"
#include "窗口1.h"

struct __启动窗口 : 窗口
{
	void 事件_创建完毕()
	{
		调试输出("你好啊白易语言");
		
		
		// 插入列
		//超列.插入列(-1, L"姓名", 80);
		//超列.插入列(-1, L"年龄", 80);
		//超列.插入列(-1, L"城市", 80);

		//// 插入数据
		//超列.插入表项(-1, L"张三");
		//超列.置标题(0, 1, L"25");
		//超列.置标题(0, 2, L"北京");
		//
		//超列.插入表项(-1, L"李四");
		//超列.置标题(1, 1, L"30");
		//超列.置标题(1, 2, L"上海");

		// === FB 极速封包/解包 测试用例 ===
		// 1. 导出封包字节集
		//Bytes colData = 超列.导出列项();
		//Bytes itemData = 超列.导出表项();
		//写到文件("colData.dat", colData);
		//写到文件("itemData.dat", itemData);
		
		// 2. 从刚刚生成的封包字节集中瞬间还原数据
		超列.载入列项(读入文件("colData.dat"));
		超列.载入表项(读入文件("itemData.dat"));
		
		窗口1.载入(this, false);
	}

#pragma region 组件成员
	超级列表框 超列;
#pragma endregion
	void 载入(窗口* 父窗 = 0, bool 模态 = 0);
	void 完毕(bool 模态 = 0);
} _启动窗口;