#include <BEMod.h>
#include "../扩展界面库一.h"

struct _窗口1 : 窗口
{
	void _导出按钮_被单击()
	{
		if (树型框1.取项目数()==0) {
			信息框("当前树型框1.取项目数=0");
			return;
		}
		写到文件("tree_colData.dat", 树型框1.导出项目());
	}

	void _载入按钮_被单击()
	{
		树型框1.载入项目(读入文件("tree_colData.dat"));
	}

	void 事件_创建完毕()
	{
		//int root1 = 树型框1.加入项目(-1, L"根项目 1");
		//树型框1.加入项目(root1, L"子项目 1.1");
		//树型框1.加入项目(root1, L"子项目 1.2");

		//int root2 = 树型框1.加入项目(-1, L"根项目 2");
		//树型框1.加入项目(root2, L"子项目 2.1");

		//树型框1.扩展项目(root1);
		//树型框1.扩展项目(root2);
	}

#pragma region 组件成员
	树型框 树型框1;
	struct _导出按钮 : 按钮 {
		void 事件_被单击() { 窗口1._导出按钮_被单击(); }
	} 导出按钮;

	struct _载入按钮 : 按钮 {
		void 事件_被单击() { 窗口1._载入按钮_被单击(); }
	} 载入按钮;
#pragma endregion

	void 载入(窗口* 父窗 = 0, bool 模态 = 0);
	void 完毕(bool 模态 = 0);
} 窗口1;