#include "../_启动窗口.h"

void __启动窗口::载入(窗口* 父窗, bool 模态)
{
	if (窗口句柄)return;
	
	参数 cs;
	cs.子控件焦点导航 = true;
	窗口::创建(参数(cs), 父窗, 模态);

	//根据窗口设计中控件的层次关系去调整创建的顺序
	{
		按钮::参数 cs(10, 96, 80, 40); //必填参数（在构造函数中强制给出）
		cs.标题 = _T("按钮1"); //可选参数
		按钮1.创建(cs, this);
	}
	{
		按钮::参数 cs(90, 120, 80, 40); //必填参数（在构造函数中强制给出）
		cs.标题 = _T("按钮2"); //可选参数
		按钮2.创建(cs, this);
	}

	{
		按钮::参数 cs(10, 10, 80, 30); //必填参数（在构造函数中强制给出）
		cs.标题 = _T("按钮3"); //可选参数
		按钮3.创建(cs, this);
	}

	{
		按钮::参数 cs(100, 10, 80, 30); //必填参数（在构造函数中强制给出）
		cs.标题 = _T("按钮4"); //可选参数
		按钮4.创建(cs, this);
	}

	{
		按钮::参数 cs(150, 60, 80, 30); //必填参数（在构造函数中强制给出）
		cs.标题 = _T("按钮5"); //可选参数
		按钮5.创建(cs, this);
		按钮5.可有焦点();
	}

	{
		分组框1.创建(分组框::参数(180, 100, 150, 80), this);
		按钮::参数 cs(10, 10, 80, 30); cs.标题 = L"按钮6";
		按钮6.创建(cs, 分组框1);
	}

	{
		分组框2.创建(分组框::参数(190, 10, 150, 80), this);
		按钮::参数 cs(10, 10, 80, 30); cs.标题 = L"按钮7";
		按钮7.创建(cs, 分组框2);
	}

	窗口::完毕(模态);
}